In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [19]:
titanic_data = pd.read_csv("../Data_science/titanic_new.csv")
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:

titanic_data['Age'] = titanic_data['Age'].fillna(titanic_data['Age'].median())

In [13]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [39]:
titanic_data['Cabin'].value_counts()

Cabin
B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: count, Length: 147, dtype: int64

In [41]:
del titanic_data['Cabin']

In [45]:
titanic_data.shape

(891, 11)

In [47]:
titanic_data.dropna(inplace=True)

In [49]:
titanic_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [53]:
# transorming categorica to numerical Lable encodingg
titanic_data['Sex'].value_counts()

Sex
male      453
female    259
Name: count, dtype: int64

In [59]:
titanic_data['Embarked'].value_counts()

Embarked
S    554
C    130
Q     28
Name: count, dtype: int64

In [61]:
from sklearn.preprocessing import LabelEncoder
label_encoder=LabelEncoder()

In [63]:
titanic_data['Sex']=label_encoder.fit_transform(titanic_data['Sex'])
titanic_data['Embarked']=label_encoder.fit_transform(titanic_data['Embarked'])

In [65]:
titanic_data['Sex'].value_counts()

Sex
1    453
0    259
Name: count, dtype: int64

In [67]:
titanic_data['Embarked'].value_counts()

Embarked
2    554
0    130
1     28
Name: count, dtype: int64

In [69]:
titanic_data=titanic_data.drop(['Name','Ticket'],axis=1) #axix =1 is for columns

In [75]:
titanic_data.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

In [79]:
#defining features x and y for model
x=titanic_data.drop("Survived",axis=1)
y = titanic_data['Survived']

In [85]:
from sklearn import tree

In [91]:
clf = tree.DecisionTreeClassifier( random_state= 45)

In [95]:
from sklearn.model_selection import cross_val_score
cv_scores = cross_val_score(clf, x, y, cv=5)

# intpreting the result

In [110]:
print("cross validation_score :",cv_scores)
print("cross validation_score mean :",cv_scores.mean())
print("cross validation_score max :",cv_scores.max())
print("cross validation_score min :",cv_scores.min())
print("cross validation_score std :",cv_scores.std())

cross validation_score : [0.57342657 0.64335664 0.71830986 0.80985915 0.84507042]
cross validation_score mean : 0.7180045306805869
cross validation_score max : 0.8450704225352113
cross validation_score min : 0.5734265734265734
cross validation_score std : 0.10105265845081277